//------------------------------------------------------------------------------
// error.cpp - Вывод сообщения об ошибке
//------------------------------------------------------------------------------

#include <stdio.h>

#include "error.h"

//------------------------------------------------------------------------------

extern int line, column; // получает от сканера

//------------------------------------------------------------------------------

// Простейшая функция, осуществляющая вывод сообщений об ошибках
void er(int i) 
{
  fprintf(stderr, "[%d, %d] ERROR %d: %s\n", line, column, i, ermes[i]);
}

