#ifndef __scaner_ext__
#define __scaner_ext__

//------------------------------------------------------------------------------
// scaner_ext.h - экспортируемые объекты сканера
//------------------------------------------------------------------------------

#include "scaner_type.h"

//------------------------------------------------------------------------------

void nxl(void); // используемая всеми функция взятия следующей лексемы

//------------------------------------------------------------------------------

extern lc_type     lc;
extern char  lv[]; 

//------------------------------------------------------------------------------

extern unsigned  unum; // преобразованное значение целого
extern double    dnum; // преобразованное значение действительного

//------------------------------------------------------------------------------

extern int line,    // номер текущей строки
           column;  // номер текущего столбца

//------------------------------------------------------------------------------

extern FILE  *infil;

//------------------------------------------------------------------------------

#endif
