#ifndef __scaner_data__
#define __scaner_data__

//------------------------------------------------------------------------------
// scaner_ext.h - îïèñàíèÿ îáùèõ äàííûõ, èñïîëüçóåìûõ ñêàíåðîì
//------------------------------------------------------------------------------

#include "scaner_type.h"

//------------------------------------------------------------------------------

int const buf_size = 256; // ðàçìåð áóôåðà ïîä çíà÷åíèå ëåêñåìû

//------------------------------------------------------------------------------

static int   si;           // ÷èòàåìûé ñèìâîë

//------------------------------------------------------------------------------

lc_type     lc;     // êëàññ ëåêñåìû

char  lv[buf_size]; // çíà÷åíèå ëåêñåìû
static int i_lv;           // òåêóùàÿ ïîçèöèÿ ïðè íàáîðå ëåêñåìû

//------------------------------------------------------------------------------

unsigned  unum;     // äâîè÷íîå ïðåäñòàâëåíèå äëÿ öåëîãî
double    dnum;     // äâîè÷íîå ïðåäñòàâëåíèå äëÿ äåéñòâèòåëüíîãî

//------------------------------------------------------------------------------

int line,     // íîìåð òåêóùåé ñòðîêè
    column;   // ïîçèöèÿ â òåêóùåé ñòðîêå

//------------------------------------------------------------------------------

FILE    *infil;

#endif